{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_5", "sparse": false}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu_conv1"}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "relu_conv1"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire2/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_squeeze1x1"}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire2/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire2/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand1x1"}, "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand3x3"}, "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire2/concat", "axis": 3}, "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "name": "fire2/concat"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire3/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "fire3/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_squeeze1x1"}, "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "name": "fire3/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire3/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire3/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand1x1"}, "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "name": "fire3/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand3x3"}, "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "name": "fire3/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire3/concat", "axis": 3}, "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "name": "fire3/concat"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "name": "pool3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire4/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "fire4/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_squeeze1x1"}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire4/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire4/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand1x1"}, "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand3x3"}, "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire4/concat", "axis": 3}, "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "name": "fire4/concat"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire5/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "fire5/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_squeeze1x1"}, "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "name": "fire5/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire5/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire5/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand1x1"}, "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "name": "fire5/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand3x3"}, "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "name": "fire5/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire5/concat", "axis": 3}, "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "name": "fire5/concat"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "name": "pool5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire6/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "fire6/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_squeeze1x1"}, "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "name": "fire6/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire6/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire6/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand1x1"}, "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "name": "fire6/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand3x3"}, "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "name": "fire6/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire6/concat", "axis": 3}, "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "name": "fire6/concat"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire7/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "name": "fire7/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_squeeze1x1"}, "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "name": "fire7/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire7/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire7/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand1x1"}, "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "name": "fire7/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand3x3"}, "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "name": "fire7/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire7/concat", "axis": 3}, "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "name": "fire7/concat"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire8/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "name": "fire8/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_squeeze1x1"}, "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "name": "fire8/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire8/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire8/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand1x1"}, "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "name": "fire8/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand3x3"}, "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "name": "fire8/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire8/concat", "axis": 3}, "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "name": "fire8/concat"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire9/squeeze1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "name": "fire9/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_squeeze1x1"}, "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "name": "fire9/relu_squeeze1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire9/expand1x1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand1x1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fire9/expand3x3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand1x1"}, "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "name": "fire9/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand3x3"}, "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "name": "fire9/relu_expand3x3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "fire9/concat", "axis": 3}, "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "name": "fire9/concat"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "drop9"}, "inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "name": "drop9"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu_conv10"}, "inbound_nodes": [[["conv10", 0, 0, {}]]], "name": "relu_conv10"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_5", "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "name": "global_average_pooling2d_5"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "loss"}, "inbound_nodes": [[["global_average_pooling2d_5", 0, 0, {}]]], "name": "loss"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["loss", 0, 0]], "name": "squeezenet"}, "backend": "tensorflow"}